# Module 9: Data Manipulation II

Datasets rarely come perfectly ready for analysis. Sometimes they need a little cleaning up, modification, or adjustment to meet the needs of your analyses. In our second lesson on data manipulation, you will learn some of the more complex methods for making changes to your dataset. 

***************

In [1]:
import pandas as pd
import numpy as np

## Creating Columns with Multiple Conditions

You can use the <b>np.select()</b> function to create and populate a column based on multiple conditions. This process is multiple steps, but once you understand the organization of the code, there is a lot of utility in the function.

In [2]:
## bringing in data to practice

people = {'Name':["Morgan", "Veronica", "Brandi", "Anne", "Paul", "Mitch", "Augustus"],
        'Age':[16, 34, 75, 67, 33, 28, 11]}

df = pd.DataFrame(people)
df

       Name  Age
0    Morgan   16
1  Veronica   34
2    Brandi   75
3      Anne   67
4      Paul   33
5     Mitch   28
6  Augustus   11

In [3]:
## Creating Age Groups based on Age Column

# define the conditions that you want to check 

conditions = [(df["Age"] >= 65), 
              (df["Age"] < 65) & (df["Age"] >= 18), 
              (df["Age"] < 18)]

# define the outcome/value for the new column based on the condition

outcome = ["Senior", "Adult", "Minor"]

### apply the np.select() function and input the lists you've jsut defined
# df[new col] = np.select(conditions list, outcome list, default = what to do if all conditions are False)

df["Age Group"] = np.select(conditions, outcome, default = "Unknown")

# check changes

df

       Name  Age Age Group
0    Morgan   16     Minor
1  Veronica   34     Adult
2    Brandi   75    Senior
3      Anne   67    Senior
4      Paul   33     Adult
5     Mitch   28     Adult
6  Augustus   11     Minor

## Replacing Values

Identify and replace specific values within the entire dataset or a subset of the dataset. You can replace specific values or you can use this methdod to also replace missing values. 

    df.replace(what to repalce, what to replace it with)

In [4]:
## bringing in data to practice

grades = {'Student':["Taylor", np.nan, "Sherrie", "Mary", "Henry", "Michael", "June"],
        'Grades':[89, 101, 100, 79, 81, 101, 97],
        'Subject':["Math", "English", "Studio Art", np.nan, "Chemistry", "Latin", "Physics"]}

df = pd.DataFrame(grades)
df

   Student  Grades     Subject
0   Taylor      89        Math
1      NaN     101     English
2  Sherrie     100  Studio Art
3     Mary      79         NaN
4    Henry      81   Chemistry
5  Michael     101       Latin
6     June      97     Physics

***
### Replacing Specific Values
***

In [5]:
## replace all the "101" values to "100"

df.replace(101, 100, inplace = True)

## check changes

df

   Student  Grades     Subject
0   Taylor      89        Math
1      NaN     100     English
2  Sherrie     100  Studio Art
3     Mary      79         NaN
4    Henry      81   Chemistry
5  Michael     100       Latin
6     June      97     Physics

In [6]:
## replace the missing value with "Unknown"

df.replace(np.nan, "Unknown", inplace = True)

## check changes

df

   Student  Grades     Subject
0   Taylor      89        Math
1  Unknown     100     English
2  Sherrie     100  Studio Art
3     Mary      79     Unknown
4    Henry      81   Chemistry
5  Michael     100       Latin
6     June      97     Physics

In [7]:
## replace a specific value in a specific column

df["Student"].replace("Mary", "Mary-Ann", inplace = True)

## check changes

df

    Student  Grades     Subject
0    Taylor      89        Math
1   Unknown     100     English
2   Sherrie     100  Studio Art
3  Mary-Ann      79     Unknown
4     Henry      81   Chemistry
5   Michael     100       Latin
6      June      97     Physics

***
### Replacing Multiple Values
***

In [ ]:
df

In [8]:
## identify and replace multiple values
## use lists to mention multiple values

df["Subject"].replace(["Latin", "English"], ["Latin Language Study", "English Lit"], inplace = True)

## check work

df

    Student  Grades               Subject
0    Taylor      89                  Math
1   Unknown     100           English Lit
2   Sherrie     100            Studio Art
3  Mary-Ann      79               Unknown
4     Henry      81             Chemistry
5   Michael     100  Latin Language Study
6      June      97               Physics

***
### Replacing Values based on a Condition
***

When you replace a value with a condition, follow the syntax below:

    df.loc[column-condition, column to make replacement] = replacement value

In [9]:
grades = {'Student':["Taylor", np.nan, "Sherrie", "Mary", "Henry", "Michael", "June"],
        'Grades':[89, 105, 100, 79, 81, 101, 97],
        'Subject':["Math", "English", "Studio Art", "Biology", "Chemistry", "Latin", "Physics"]}

df = pd.DataFrame(grades)
df

   Student  Grades     Subject
0   Taylor      89        Math
1      NaN     105     English
2  Sherrie     100  Studio Art
3     Mary      79     Biology
4    Henry      81   Chemistry
5  Michael     101       Latin
6     June      97     Physics

In [10]:
df["Passed"] = 0

## check changes

df

   Student  Grades     Subject  Passed
0   Taylor      89        Math       0
1      NaN     105     English       0
2  Sherrie     100  Studio Art       0
3     Mary      79     Biology       0
4    Henry      81   Chemistry       0
5  Michael     101       Latin       0
6     June      97     Physics       0

In [11]:
df.loc[df["Grades"] > 100]

   Student  Grades  Subject  Passed
1      NaN     105  English       0
5  Michael     101    Latin       0

In [12]:
## if grade is greater than 79, the value in the passed column is replaced by 1
## don't need to use inplace = True in this situation

df.loc[df["Grades"] > 100, "Grades"] = 100

## check changes

df

   Student  Grades     Subject  Passed
0   Taylor      89        Math       0
1      NaN     100     English       0
2  Sherrie     100  Studio Art       0
3     Mary      79     Biology       0
4    Henry      81   Chemistry       0
5  Michael     100       Latin       0
6     June      97     Physics       0

In [13]:
df.loc[df["Grades"] > 85, "Passed"] = 1

## check changes

df

   Student  Grades     Subject  Passed
0   Taylor      89        Math       1
1      NaN     100     English       1
2  Sherrie     100  Studio Art       1
3     Mary      79     Biology       0
4    Henry      81   Chemistry       0
5  Michael     100       Latin       1
6     June      97     Physics       1

***
### Replacing Values based on Multiple Conditions
***

In [14]:
## adding new column 

df["Honor_Role"] = "No"

df

   Student  Grades     Subject  Passed Honor_Role
0   Taylor      89        Math       1         No
1      NaN     100     English       1         No
2  Sherrie     100  Studio Art       1         No
3     Mary      79     Biology       0         No
4    Henry      81   Chemistry       0         No
5  Michael     100       Latin       1         No
6     June      97     Physics       1         No

In [15]:
## replacing the value based on two conditions


df.loc[((df["Grades"] > 89) & (df["Passed"] == 1)), "Honor_Role"] = "Yes"

## check changes

df

   Student  Grades     Subject  Passed Honor_Role
0   Taylor      89        Math       1         No
1      NaN     100     English       1        Yes
2  Sherrie     100  Studio Art       1        Yes
3     Mary      79     Biology       0         No
4    Henry      81   Chemistry       0         No
5  Michael     100       Latin       1        Yes
6     June      97     Physics       1        Yes

# { Exercise 1 }

Run the cell below to create the passenger dataset.

In [16]:
## Airline Passenger Data
 
passenger = {"Name":["Carmen Stanley", "Marley Smith", "Chadwick Tyler", "Vernon Templeton", "Kim Balgor"], 
             "Gender":["F", "M", np.nan, "M", "F"], 
             "Nationality":["Columbia", "Scotland", "USA", "Canada", "South Africa"], 
             "Airline":["Delta", "Southwest", np.nan, np.nan, "United"], 
             "Ticket Price":[456.99, 206.00, 567.75, 789.77, 132.45],
             "Seat Class":["Eco", "Eco", "Business", "First Class", "Eco"], 
             "Seat Assign": ["18B", "23A", "9C", "2A", "34D"], 
             "Checked Bag":["Y", "Y", "N", "Y", "N"], 
             "CarryOn Bag":["Y", "Y", "Y", "N", "N"], 
             "Destination":["ATL", "LA", "NYC", "ATL", "CHI"], 
             "RoundTrip": [1, 1, 0, 0, 1]}

df = pd.DataFrame(passenger)

df

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip
0,Carmen Stanley,F,Columbia,Delta,456.99,Eco,18B,Y,Y,ATL,1
1,Marley Smith,M,Scotland,Southwest,206.00,Eco,23A,Y,Y,LA,1
2,Chadwick Tyler,NaN,USA,NaN,567.75,Business,9C,N,Y,NYC,0
3,Vernon Templeton,M,Canada,NaN,789.77,First Class,2A,Y,N,ATL,0
4,Kim Balgor,F,South Africa,United,132.45,Eco,34D,N,N,CHI,1

1. Replace the missing values in the dataset with the term "Unknown". Use the replace() function to do this.

In [17]:
df.replace(np.nan, "Unknown", inplace = True)
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip
0,Carmen Stanley,F,Columbia,Delta,456.99,Eco,18B,Y,Y,ATL,1
1,Marley Smith,M,Scotland,Southwest,206.00,Eco,23A,Y,Y,LA,1
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,N,Y,NYC,0
3,Vernon Templeton,M,Canada,Unknown,789.77,First Class,2A,Y,N,ATL,0
4,Kim Balgor,F,South Africa,United,132.45,Eco,34D,N,N,CHI,1

2. In the gender column, replace the values "M" and "F" with "Male" and "Female".

In [18]:
df["Gender"].replace(["M", "F"], ["Male", "Female"], inplace = True)
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip
0,Carmen Stanley,Female,Columbia,Delta,456.99,Eco,18B,Y,Y,ATL,1
1,Marley Smith,Male,Scotland,Southwest,206.00,Eco,23A,Y,Y,LA,1
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,N,Y,NYC,0
3,Vernon Templeton,Male,Canada,Unknown,789.77,First Class,2A,Y,N,ATL,0
4,Kim Balgor,Female,South Africa,United,132.45,Eco,34D,N,N,CHI,1

3. Throughout the entire dataset, replace the values "Y" and "N" with "Yes" and "No".

In [19]:
df.replace(["Y", "N"], ["Yes", "No"], inplace = True)
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip
0,Carmen Stanley,Female,Columbia,Delta,456.99,Eco,18B,Yes,Yes,ATL,1
1,Marley Smith,Male,Scotland,Southwest,206.00,Eco,23A,Yes,Yes,LA,1
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,No,Yes,NYC,0
3,Vernon Templeton,Male,Canada,Unknown,789.77,First Class,2A,Yes,No,ATL,0
4,Kim Balgor,Female,South Africa,United,132.45,Eco,34D,No,No,CHI,1

4. In the seat class column, replace the value "Eco" with "Economy".

In [20]:
df["Seat Class"].replace("Eco", "Economy", inplace = True)
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip
0,Carmen Stanley,Female,Columbia,Delta,456.99,Economy,18B,Yes,Yes,ATL,1
1,Marley Smith,Male,Scotland,Southwest,206.00,Economy,23A,Yes,Yes,LA,1
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,No,Yes,NYC,0
3,Vernon Templeton,Male,Canada,Unknown,789.77,First Class,2A,Yes,No,ATL,0
4,Kim Balgor,Female,South Africa,United,132.45,Economy,34D,No,No,CHI,1

5. Create a new column called "Trip Price", all the values should be equal to the "Ticket Price" column.

In [21]:
df["Trip Price"] = df["Ticket Price"]
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip,Trip Price
0,Carmen Stanley,Female,Columbia,Delta,456.99,Economy,18B,Yes,Yes,ATL,1,456.99
1,Marley Smith,Male,Scotland,Southwest,206.00,Economy,23A,Yes,Yes,LA,1,206.00
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,No,Yes,NYC,0,567.75
3,Vernon Templeton,Male,Canada,Unknown,789.77,First Class,2A,Yes,No,ATL,0,789.77
4,Kim Balgor,Female,South Africa,United,132.45,Economy,34D,No,No,CHI,1,132.45

6. If RoundTrip equals 1, replace the value of Trip Price with double the ticket price.

In [22]:
df.loc[df["RoundTrip"] == 1, "Trip Price"] = 2 * df["Ticket Price"]
df.head()

,Name,Gender,Nationality,Airline,Ticket Price,Seat Class,Seat Assign,Checked Bag,CarryOn Bag,Destination,RoundTrip,Trip Price
0,Carmen Stanley,Female,Columbia,Delta,456.99,Economy,18B,Yes,Yes,ATL,1,913.98
1,Marley Smith,Male,Scotland,Southwest,206.00,Economy,23A,Yes,Yes,LA,1,412.00
2,Chadwick Tyler,Unknown,USA,Unknown,567.75,Business,9C,No,Yes,NYC,0,567.75
3,Vernon Templeton,Male,Canada,Unknown,789.77,First Class,2A,Yes,No,ATL,0,789.77
4,Kim Balgor,Female,South Africa,United,132.45,Economy,34D,No,No,CHI,1,264.90

## Binning Data 

Binning data allows you to segment values into specific groups. Once you have the gruops created, you can explore groupings as you would categorical variables. 

For example, if instead of looking at the column of final grade values, you just wanted to know if the student passed or failed - you could create a new column to show which final grade falls into the "fail bin" and which final grade falls into the "pass bin". 

Before you can create the bins, you have to specify the parameters of which values will fall into which specific bins. This will take a series of quick steps.

In [24]:
## create dataset to practice with 

grades = {'Student':["Taylor", np.nan, "Sherrie", "Mary", "Henry", "Michael", "June"],
        'Grades': [89, 56, 100, 68, 81, 71, 97],
        'Subject':["Math", "English", "Studio Art", "Biology", "Chemistry", "Latin", "Physics"]}

df = pd.DataFrame(grades)
df

   Student  Grades     Subject
0   Taylor      89        Math
1      NaN      56     English
2  Sherrie     100  Studio Art
3     Mary      68     Biology
4    Henry      81   Chemistry
5  Michael      71       Latin
6     June      97     Physics

In [25]:
### Convert number grades into letter grades

# 0 - 60 = F
# 60.1 - 70 = D
# 70.1 - 80 = C
# 80.1 - 90 = B
# 90.1 - 100+ = A

#### STEP 1: create the bin limits ####

bins = [0, 60, 70, 80, 90, 150]

## the bin limits are the cutoff points for the values
## each number shown is the cutoff for a specific group (0-60, 60.1 - 70, 70.1 - 80...)

bin_labels = ["F", "D", "C", "B", "A"]

## the bin labels are the group names that will be created
## there should always be one less group than bins

#### STEP 2: apply your bins to a specific column (or create new column) in dataset  ####
## new column = pd.cut(column to apply to, bin cutoff list, labels = list of bin labels)
# pd.cut function segments and organizes values into the appropriate bin

df["Letter Grades"] = pd.cut(df["Grades"], bins, labels = bin_labels)

#### STEP 3: check changes  ####

df

   Student  Grades     Subject Letter Grades
0   Taylor      89        Math             B
1      NaN      56     English             F
2  Sherrie     100  Studio Art             A
3     Mary      68     Biology             D
4    Henry      81   Chemistry             B
5  Michael      71       Latin             C
6     June      97     Physics             A

In [26]:
## now that you have a categorical variable, use value counts

df["Letter Grades"].value_counts()

B    2
A    2
F    1
D    1
C    1
Name: Letter Grades, dtype: int64

# { Exercise 2 }

Run the cell below to recreate the passengers dataset. Answer the questions below.

In [ ]:
## Airline Passenger Data
 
passenger = {"Name":["Carmen Stanley", "Marley Smith", "Chadwick Tyler", "Vernon Templeton", "Kim Balgor"], 
             "Gender":["F", "M", np.nan, "M", "F"], 
             "Nationality":["Columbia", "Scotland", "USA", "Canada", "South Africa"], 
             "Airline":["Delta", "Southwest", np.nan, np.nan, "United"], 
             "Ticket Price":[456.99, 206.00, 567.75, 789.77, 132.45],
             "Seat Class":["Eco", "Eco", "Business", "First Class", "Eco"], 
             "Seat Assign": ["18B", "23A", "9C", "2A", "34D"], 
             "Checked Bag":["Y", "Y", "N", "Y", "N"], 
             "CarryOn Bag":["Y", "Y", "Y", "N", "N"], 
             "Destination":["ATL", "LA", "NYC", "ATL", "CHI"], 
             "RoundTrip": [1, 1, 0, 0, 1]}

df = pd.DataFrame(passenger)

df

1. Drop the "Seat Class" column from the dataset. Let's recreate this column using bins.

2. Create bins for ticket price. Using the following limits, create bins to represent these limits, then create labels for the bins. The limits for each bin are the following:

        0 - 200 = Discount
        201 - 350 = Economy        
        351 - 500 = Business       
        501 - 1000 = First Class

3. Create a new column called "passenger class". Bin the 'ticket price' column and save the new groups in the 'passenger class' column. You need to use the pd.cut() function to complete this.

## Defining and Applying Custom Functions

User-defined functions allow you to create shortcuts when working with your specific dataset. While there are several libraries that have functions for your use, sometimes you want something designed specifically to make your life easier when working with your specific data.

In [ ]:
## create dataset to practice with 

grades = {'Student':["Taylor", np.nan, "Sherrie", "Mary", "Henry", "Michael", "June"],
        'Grades': [89, 56, 100, 68, 81, 71, 97],
        'Subject':["Math", "English", "Studio Art", "Biology", "Chemistry", "Latin", "Physics"]}

df = pd.DataFrame(grades)
df

In [ ]:
## refresher on defining functions ##

def addNumbers(x, y):
    return x + y

## apply function:

addNumbers(10, 6)

In [ ]:
df

In [ ]:
## creating functions to apply to dataset ##
## add 20 pts to the student grade

def bonusGrade(OriginalGrade):
    return OriginalGrade + 20

## apply function to dataset column 

df["UpdatedGrade"] = df["Grades"].apply(bonusGrade)

# check changes

df

In [ ]:
## creating functions to apply to dataset ##
## convert numeric grade to letter grade

def letterGrade(numGrade):
    if numGrade >= 90:
        return "A"
    elif numGrade >= 80:
        return "B"
    elif numGrade >= 70:
        return "C"
    elif numGrade >= 60:
        return "D"
    else:
        return "F"

## apply function to dataset column 

df["Letter Grade"] = df["Grades"].apply(letterGrade)

df["Updated Letter Grade"] = df["UpdatedGrade"].apply(letterGrade)

# check changes

df

# { Excerise 3 }

Run the cell below to recreate the passengers dataset. Answer the questions below.

In [ ]:
## Airline Passenger Data
 
passenger = {"Name":["Carmen Stanley", "Marley Smith", "Chadwick Tyler", "Vernon Templeton", "Kim Balgor"], 
             "Gender":["F", "M", np.nan, "M", "F"], 
             "Nationality":["Columbia", "Scotland", "USA", "Canada", "South Africa"], 
             "Airline":["Delta", "Southwest", np.nan, np.nan, "United"], 
             "Ticket Price":[456.99, 206.00, 567.75, 789.77, 132.45],
             "Seat Class":["Eco", "Eco", "Business", "First Class", "Eco"], 
             "Seat Assign": ["18B", "23A", "9C", "2A", "34D"], 
             "Checked Bag":["Y", "Y", "N", "Y", "N"], 
             "CarryOn Bag":["Y", "Y", "Y", "N", "N"], 
             "Destination":["ATL", "LA", "NYC", "ATL", "CHI"], 
             "RoundTrip": [1, 1, 0, 0, 1]}

df = pd.DataFrame(passenger)

df

1. Create a function that replaces the values 1 and 0 to "Yes" and "No". Apply this function to the "rount trip" column.

## Manipulating String Data

When you apply functions to columns with string data, the changes you make will apply to all the values in that column. This makes it very easy to make big changes quickly. Some of these functions will be familiar from when we were working with just strings (outside of a dataset)!

When you are using string functions on data from a dataset, you need to specify that you are working with string-type data by using the "str" addition to your code.

In [ ]:
df = pd.read_excel("Movie_Data.xlsx")

df.head()

***
### Altering String Case (uppercase, lowercase, titlecase)
***

In [ ]:
## Overwrite the Title column to convert all movie titles to uppercase

df["Title"] = df["Title"].str.upper()

df.head()

In [ ]:
## Overwrite the Title column to convert all movie titles to lowercase

df["Title"] = df["Title"].str.lower()

df.head()

In [ ]:
## Overwrite the Title column to convert all movie titles to titlecase

df["Title"] = df["Title"].str.title()

df.head()

# { Exercise 4 }

1. Uppercase the "Runtime" column

2. Lowercase the "Star 3" column

3. Change the "Runtime" into titlecase

***
### Removing White Space from Text
***

In [ ]:
## overwrite the Runtime column to strip all white spaces from the front and end of the text

df["Runtime"] = df["Runtime"].str.strip()

df.head()

In [ ]:
## remove all white spaces from right side of text

df["Runtime"] = df["Runtime"].str.rstrip()

df.head()

In [ ]:
## remove all white spaces from left side of text

df["Runtime"] = df["Runtime"].str.lstrip()

df.head()

***
### Replace Specific Characters
***

In [ ]:
df.head()

In [ ]:
## replace specific symbol in a specific column

df["Genre"] = df["Genre"].str.replace(",", "/")

# check changes

df.head()

# { Exercise 5 }

1. Replace the white spaces (represented by " ") in 'Runtime' with a dash (-)

***
### Splitting Strings of Text
***

In [ ]:
## Split the string of text at the white spaces
## you will be returned a list of words 

df["Star 2"] = df["Star 2"].str.split()

# check changes

df.head()

In [ ]:
## Split the string into new columns

# split(n = 1, expand = True)
## n = x >> split the string after a certain amount of white spaces only
## expand = True >> expand the split text into new columns 

df[["Dir First", "Dir Last"]] = df["Director"].str.split(n = 1, expand = True)

# check changes

df.head()

In [ ]:
### Split the string into new columns
# split the sting based on a specific symbol; the code will split the string at all the instances of the symbol given

df[["Genre_1", "Genre_2", "Genre_3"]] = df["Genre"].str.split("/", expand = True)

# check changes

df.head()

***
### Converting Columns to Different Data Types
***

In [ ]:
df.info()

In [ ]:
# convert IMDB column to float - how does the output change?

df["IMDB rating"] = df["IMDB rating"].astype(str)

In [ ]:
df.dtypes

In [ ]:
# convert IMDB column to float

df["IMDB rating"] = df["IMDB rating"].astype(float)

In [ ]:
df.dtypes

In [ ]:
# convert IMDB column to integer

df["IMDB rating"] = df["IMDB rating"].astype(int)

In [ ]:
df.dtypes